base/Documents/бит_му_РазнесениеСальдоНаОтчетнуюДату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_РазнесениеСальдоНаОтчетнуюДату</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСторно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРазнесения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_му_НастройкиРазнесенияСальдо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разнесение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетАП</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаКт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетА</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоА_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоА_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоА_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоА_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетП</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоП_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоП_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоП_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоП_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньДетализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеглДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеглКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпрДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпрКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_му_РазнесениеСальдоНаОтчетнуюДату/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мКоличествоСубконтоМУ; // Хранит количество субконто МУ.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПервоначальноеЗаполнениеДокумента();
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураТаблиц 		= ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента);	
	
	// ШАБЛОН
	// ПроверкаДанных(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок);
	
	// Получим курсы валют, неоходимые для выполнения пересчетов.
	ВидыКурсов = Новый Структура("Упр, Регл, МУ, Документ");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, Отказ, Заголовок);
	КонецЕсли;
               
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		

	
	// ШАБЛОН
	//// Подсчитаем и запишем сумму документа.
	// СуммаДокумента = <ИмяТабличнойЧасти>.Итог("Сумма");
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ПриКопировании(ОбъектКопирования)
	
	ПервоначальноеЗаполнениеДокумента(ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура обрабатывает изменение валюты документа.
// 
Процедура ИзменениеВалютыМодуль() Экспорт

	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	КурсДокумента      = СтруктураКурса.Курс;
	КратностьДокумента = СтруктураКурса.Кратность;

КонецПроцедуры // ИзменениеВалютыМодуль()

// Процедура обрабатывает изменение счета БУ в табличном поле.
// 
// Параметры:
//  ТекущиеДанные  			- ДанныеФормыЭлементКоллекции 
//								или ДокументТабличнаяЧастьСтрока.бит_му_РазнесениеСальдоНаОтчетнуюДату.Разнесение.
//  ИмяСубконто 			- Строка.
//  ИмяСчета    			- Строка.
//  ИмяКоличестваДоступных 	- Строка.
//
Процедура ИзменениеСчетаТабличноеПолеМУ(ТекущиеДанные, ИмяСубконто, ИмяСчета, ИмяКоличестваДоступных) Экспорт
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекущиеДанные[ИмяСчета], мКоличествоСубконтоМУ);									  
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(ТекущиеДанные, НастройкиСубконто, ИмяСубконто);
	
	Если ИмяСчета <> "СчетАП" Тогда
		ЗаполнитьСубконтоПростыхСчетов(ТекущиеДанные, ИмяСчета);	
	КонецЕсли;
	
КонецПроцедуры // ИзменениеСчетаВТабличномПолеМУ()

// Процедура заполняет табличную часть "ДанныеРеклассификации".
// 
Процедура ЗаполнитьТчРазнесение() Экспорт
	
	ТекНастройкаРазнесения = НастройкаРазнесения;
    
    Если ТекНастройкаРазнесения.Разнесение.Количество() = 0 Тогда
        // Если в настройке не заполнена табличная часть, то не получится сформировать запрос.
        Возврат;    
    КонецЕсли;
    
	РезультатЗапроса = ПолучитьРезультатЗапросаДляЗаполненияТч(ТекНастройкаРазнесения);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Новая строка табличной части.
		СтрокаРазнесения = Разнесение.Добавить();
		
		// Заполним счета.
		СтрокаРазнесения.СчетАП = Выборка.СчетАП;
		СтрокаРазнесения.СчетА  = Выборка.СчетА;
		СтрокаРазнесения.СчетП  = Выборка.СчетП;
		
		ИзменениеСчетаТабличноеПолеМУ(СтрокаРазнесения, "Субконто_" , "СчетАП", "КоличествоДоступныхСубконтоАП");
		ИзменениеСчетаТабличноеПолеМУ(СтрокаРазнесения, "СубконтоА_", "СчетА" , "КоличествоДоступныхСубконтоА");
		ИзменениеСчетаТабличноеПолеМУ(СтрокаРазнесения, "СубконтоП_", "СчетП" , "КоличествоДоступныхСубконтоП");
		
		// Заполним значения строки тч.
		ЗаполнитьЗначенияСвойств(СтрокаРазнесения, Выборка, , "СчетАП, СчетА, СчетП");
		ЗаполнитьСубконтоПростыхСчетов(СтрокаРазнесения);
		
		
		// ВалютаДт, ВалютаКт.
		СтрокаРазнесения.ВалютаДт = Выборка.Валюта;		
		СтрокаРазнесения.ВалютаКт = Выборка.Валюта;		
			
	КонецЦикла;				

КонецПроцедуры // ЗаполнитьТчРазнесение()

// Процедура заполняет документ.
// 
// Параметры:
//  Структура.
//
Процедура ЗаполнитьДокумент(СтруктураЗаполнения) Экспорт

	// Обязательные для заполнения поля: Дата, Организация, НастройкаРазнесения.
	Для каждого КлЗнч Из СтруктураЗаполнения Цикл
		ИмяРеквизита = КлЗнч.Ключ;
		Если ИмяРеквизита = "Дата" ИЛИ Метаданные().Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита] = КлЗнч.Значение;
		КонецЕсли; 	
	КонецЦикла;
	
	// Получим валюту международного учета.
	ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация);
	ИзменениеВалютыМодуль();
	
	// Заполняет табличную часть "Разнесение".
	ЗаполнитьТчРазнесение();	

КонецПроцедуры // ЗаполнитьДокумент()

// Функция готовит таблицы документа для проведения.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  Структура.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЧасть.НомерСтроки,
	|	ТабЧасть.СчетАП,
	|	ТабЧасть.Субконто_1,
	|	ТабЧасть.Субконто_2,
	|	ТабЧасть.Субконто_3,
	|	ТабЧасть.Субконто_4,
	|	ТабЧасть.ВалютаДт,
	|	ТабЧасть.ВалютнаяСуммаДт,
	|	ТабЧасть.СальдоДт,
	|	ТабЧасть.ВалютаКт,
	|	ТабЧасть.ВалютнаяСуммаКт,
	|	ТабЧасть.СальдоКт,
	|	ТабЧасть.СчетА,
	|	ТабЧасть.СубконтоА_1,
	|	ТабЧасть.СубконтоА_2,
	|	ТабЧасть.СубконтоА_3,
	|	ТабЧасть.СубконтоА_4,
	|	ТабЧасть.СчетП,
	|	ТабЧасть.СубконтоП_1,
	|	ТабЧасть.СубконтоП_2,
	|	ТабЧасть.СубконтоП_3,
	|	ТабЧасть.СубконтоП_4,
	|	ТабЧасть.СуммаРеглДт,
	|	ТабЧасть.СуммаРеглКт,
	|	ТабЧасть.СуммаУпрДт,
	|	ТабЧасть.СуммаУпрКт,
	|	ТабЧасть.КоличествоДт,
	|	ТабЧасть.КоличествоКт
	|ИЗ
	|	Документ.бит_му_РазнесениеСальдоНаОтчетнуюДату.Разнесение КАК ТабЧасть
	|ГДЕ
	|	ТабЧасть.Ссылка = &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРазнесение = РезультатЗапроса.Выгрузить();
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("Разнесение", ТаблицаРазнесение);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицыДокумента()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет реквизиты строки: СубконтоА_№  и СубконтоП_№.
// 
// Параметры:
//  СтрокаРазнесения - ДанныеФормыЭлементКоллекции.
//  ИмяСчета		 - Строка.
// 
Процедура ЗаполнитьСубконтоПростыхСчетов(СтрокаРазнесения, ИмяСчета = Неопределено)

	Для ИндексСубконтоАП = 1 По мКоличествоСубконтоМУ Цикл
		
		ИмяСубконто = "Субконто_" + ИндексСубконтоАП;
		ЗначениеСубконто = СтрокаРазнесения[ИмяСубконто];
		
		Если ЗначениеЗаполнено(ЗначениеСубконто) Тогда
			
			СвСчАП = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаРазнесения["СчетАП"]);
			СвСчАктивный = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаРазнесения["СчетА"]);
			СвСчПассивный = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаРазнесения["СчетП"]);
			
			ВидСубконто = СвСчАП["ВидСубконто" + ИндексСубконтоАП];
			
			Для ИндексСубконто = 1 По мКоличествоСубконтоМУ Цикл
				ИмяСубконтоА = "СубконтоА_" + ИндексСубконто;
				ИмяСубконтоП = "СубконтоП_" + ИндексСубконто;
				
				ВидСубконтоАктивный = СвСчАктивный["ВидСубконто" + ИндексСубконто];
			    ВидСубконтоПассивный = СвСчПассивный["ВидСубконто" + ИндексСубконто];
				
				Если ВидСубконто = ВидСубконтоАктивный Тогда
					СтрокаРазнесения[ИмяСубконтоА] = ЗначениеСубконто;
				КонецЕсли; 
				
				Если ВидСубконто = ВидСубконтоПассивный Тогда
					СтрокаРазнесения[ИмяСубконтоП] = ЗначениеСубконто;
				КонецЕсли; 
				
			КонецЦикла; 				
		КонецЕсли;
	
	КонецЦикла;	

КонецПроцедуры

// Процедура выполняет первоначальное заполнение созданного/скопированного документа.
// 
// Параметры:
//  ПараметрОбъектКопирования - ДокументОбъект.
// 
Процедура ПервоначальноеЗаполнениеДокумента(ПараметрОбъектКопирования = Неопределено)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ПараметрОбъектКопирования);
	
	// Документ не скопирован.
	Если ПараметрОбъектКопирования = Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(ВалютаДокумента) Тогда			
			// Заполним валюту документа валютой международного учета.
			ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация,, Ложь);			
		КонецЕсли; 
		
	КонецЕсли;
	
	ИзменениеВалютыМодуль();
	
КонецПроцедуры // ПервоначальноеЗаполнениеДокумента()

// Функция формирует строки запроса для субконто.
// 
// Параметры:
//  Счетчик  			  - Число.
//  ТекУровеньДетализации - Число.
//  
// Возвращаемое значение:
//   Струткура (СтрокаВыбораСубконто, СтрокаГруппировкиПоСубконто).
// 
Функция ПолучитьСтрокиЗапросаПоСубконто(Счетчик, ТекУровеньДетализации)

	СтрокаВыбораСубконто 		= ""; 
	СтрокаГруппировкиПоСубконто = "";
	
	Для НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
		
		СтрокаСубконто = Строка(НомерСубконто);
		
		СтрокаПредставления = ?(Счетчик = 1," КАК Субконто_" + СтрокаСубконто + ",", ",");
		
		Если НомерСубконто > ТекУровеньДетализации Тогда
			
			СтрокаВыбораСубконто = СтрокаВыбораСубконто + "
			|	NULL " + СтрокаПредставления;
			
		Иначе	
			
			СтрокаВыбораСубконто = СтрокаВыбораСубконто + "
			|	бит_му_Остатки.Субконто" + СтрокаСубконто + СтрокаПредставления;
			
			СтрокаГруппировкиПоСубконто = СтрокаГруппировкиПоСубконто + "
			|	бит_му_Остатки.Субконто" + СтрокаСубконто + ",";
			
		КонецЕсли;	
		
	КонецЦикла;
		
	СтруктураСтрок = Новый Структура("СтрокаВыбораСубконто, СтрокаГруппировкиПоСубконто", 
									СтрокаВыбораСубконто, СтрокаГруппировкиПоСубконто);

	Возврат СтруктураСтрок;
	
КонецФункции // ПолучитьСтрокиПоСубконто()

// Функция формирует результат запроса для заполнения табличной части.
// 
// Параметры:
//  НастройкаРазнесения - СправочникСсылка.бит_му_НастройкиРазнесенияСальдо.
//  
// Возвращаемое значение:
//   Результат выполнения запроса.
// 
Функция ПолучитьРезультатЗапросаДляЗаполненияТч(НастройкаРазнесения)

	Результат = Неопределено;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"	   , Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
		
	Счетчик 	 = 1;
	ТекстЗапроса = "";
	Для каждого СтрокаНастройки Из НастройкаРазнесения.Разнесение Цикл
		
		СтрокаСчетчик = Строка(Счетчик);
		
		// Данные из строки настройки.
		ТекУровеньДетализации = СтрокаНастройки.УровеньДетализации;
		ТекСчетАП 			  = СтрокаНастройки.СчетАП;
		ТекСчетА 			  = СтрокаНастройки.СчетА;
		ТекСчетП 			  = СтрокаНастройки.СчетП;
		
		// Имена параметров УровеньДетализации_№ и Счет_№.
		ИмяПараметраУровеньДетализации = "УровеньДетализации_" + СтрокаСчетчик;
		ИмяПараметраСчетАП 			   = "СчетАП_" + СтрокаСчетчик;
		ИмяПараметраСчетА 			   = "СчетА_"  + СтрокаСчетчик;
		ИмяПараметраСчетП 			   = "СчетП_"  + СтрокаСчетчик;
		
		// Параметры запроса.
		Запрос.УстановитьПараметр(ИмяПараметраУровеньДетализации, ТекУровеньДетализации);
		Запрос.УстановитьПараметр(ИмяПараметраСчетАП			, ТекСчетАП);
		Запрос.УстановитьПараметр(ИмяПараметраСчетА				, ТекСчетА);
		Запрос.УстановитьПараметр(ИмяПараметраСчетП				, ТекСчетП);
		
		// Строки текста запроса для выбора и группировки субконто.
		СтрукутраСтрок = ПолучитьСтрокиЗапросаПоСубконто(Счетчик, ТекУровеньДетализации);
		СтрокаВыбораСубконто 		= СтрукутраСтрок.СтрокаВыбораСубконто; 
		СтрокаГруппировкиПоСубконто = СтрукутраСтрок.СтрокаГруппировкиПоСубконто;
		
		// Текст запроса - ВЫБРАТЬ.
		Если Счетчик = 1 Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ	
			|	&" + ИмяПараметраУровеньДетализации + " 	 КАК УровеньДетализации,
			|	бит_му_Остатки.Счет							 КАК СчетАП,
			|	&" + ИмяПараметраСчетА + "					 КАК СчетА,
			|	&" + ИмяПараметраСчетП + "					 КАК СчетП,
			|	бит_му_Остатки.Организация					 КАК Организация,
			|	" + СтрокаВыбораСубконто + "
			|	СУММА(бит_му_Остатки.СуммаМУОстатокДт)  	 КАК СальдоДт,
			|	СУММА(бит_му_Остатки.СуммаМУОстатокКт)  	 КАК СальдоКт,
			|	ЕСТЬNULL(бит_му_Остатки.Валюта, Значение(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
			|	СУММА(бит_му_Остатки.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаДт,
			|	СУММА(бит_му_Остатки.ВалютнаяСуммаОстатокКт) КАК ВалютнаяСуммаКт,
			|	СУММА(бит_му_Остатки.СуммаРеглОстатокДт) 	 КАК СуммаРеглДт,
			|	СУММА(бит_му_Остатки.СуммаРеглОстатокКт) 	 КАК СуммаРеглКт,
			|	СУММА(бит_му_Остатки.СуммаУпрОстатокДт) 	 КАК СуммаУпрДт,
			|	СУММА(бит_му_Остатки.СуммаУпрОстатокКт) 	 КАК СуммаУпрКт,
			|	СУММА(бит_му_Остатки.КоличествоОстатокДт) 	КАК КоличествоДт,
			|	СУММА(бит_му_Остатки.КоличествоОстатокКт) 	КАК КоличествоКт
			|"; 		
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ	
			|	&" + ИмяПараметраУровеньДетализации + ",
			|	бит_му_Остатки.Счет,
			|	&" + ИмяПараметраСчетА + ",
			|	&" + ИмяПараметраСчетП + ",
			|	бит_му_Остатки.Организация,
			|	" + СтрокаВыбораСубконто + "
			|	СУММА(бит_му_Остатки.СуммаМУОстатокДт),
			|	СУММА(бит_му_Остатки.СуммаМУОстатокКт),
			|	ЕСТЬNULL(бит_му_Остатки.Валюта, Значение(Справочник.Валюты.ПустаяСсылка)),
			|	СУММА(бит_му_Остатки.ВалютнаяСуммаОстатокДт),
			|	СУММА(бит_му_Остатки.ВалютнаяСуммаОстатокКт),
			|	СУММА(бит_му_Остатки.СуммаРеглОстатокДт),
			|	СУММА(бит_му_Остатки.СуммаРеглОстатокКт),
			|	СУММА(бит_му_Остатки.СуммаУпрОстатокДт),
			|	СУММА(бит_му_Остатки.СуммаУпрОстатокКт),
			|	СУММА(бит_му_Остатки.КоличествоОстатокДт),
			|	СУММА(бит_му_Остатки.КоличествоОстатокКт)
			|";
		КонецЕсли;
		
		// Текст запроса - ИЗ, СГРУППИРОВАТЬ. 
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(&Дата, Счет = &" + ИмяПараметраСчетАП + ", , Организация = &Организация) КАК бит_му_Остатки
        |
		|СГРУППИРОВАТЬ ПО
		|	бит_му_Остатки.Организация,
		|	бит_му_Остатки.Счет,
		|	" + СтрокаГруппировкиПоСубконто + "	
		|	ЕСТЬNULL(бит_му_Остатки.Валюта, Значение(Справочник.Валюты.ПустаяСсылка))
		|"; 		
		
		// Увеличение счетчика.
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьРезультатЗапросаДляЗаполненияТч()

#Область ПроцедурыИФункцииДляОбеспеченияПроведенияДокумента

// Процедура выполняет движения по регистрам.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  СтруктураКурсыВалют 	- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, Отказ, Заголовок)
	
	ТаблицаДанных = СтруктураТаблиц.Разнесение;
	
	Движения.бит_Дополнительный_2.Записывать = Истина;
	Движения.бит_Дополнительный_2.Очистить();
	
	Содержание = НСтр("ru = 'Разнесение сальдо активно-пассивных счетов'; en = 'Active-passive account balance posting'");
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		// -----------------------------------------------------------------
		// ДТ СчетА КТ СчетАП - СальдоДт, ВалютнаяСуммаДт...  		
		Если СтрокаТаблицы.СальдоДт <> 0 ИЛИ СтрокаТаблицы.ВалютнаяСуммаДт <> 0 Тогда
			СформироватьЗаписи("Дт", СтрокаТаблицы, Содержание, СтруктураШапкиДокумента, СтруктураКурсыВалют);
			СформироватьЗаписи("Дт", СтрокаТаблицы, Содержание, СтруктураШапкиДокумента, СтруктураКурсыВалют, Истина);
		КонецЕсли;                    	
		       		 		
		// -----------------------------------------------------------------
		// ДТ СчетАП КТ СчетП - СальдоКт, ВалютнаяСуммаКт...   			
		Если СтрокаТаблицы.СальдоКт <> 0 ИЛИ СтрокаТаблицы.ВалютнаяСуммаКт <> 0 Тогда
			СформироватьЗаписи("Кт", СтрокаТаблицы, Содержание, СтруктураШапкиДокумента, СтруктураКурсыВалют);
			СформироватьЗаписи("Кт", СтрокаТаблицы, Содержание, СтруктураШапкиДокумента, СтруктураКурсыВалют, Истина);
		КонецЕсли;
			
	КонецЦикла;
		
КонецПроцедуры // ДвиженияПоРегистрам()

// Процедура формирует движение.
// 
// Параметры:
//  ПостфиксРесурсов 		- Строка.
//  СтрокаТаблицы 			- Строка таблицы значений.
//  Содержание 				- Строка.
//  СтруктураШапкиДокумента - Структура.
//  СтруктураКурсыВалют 	- Структура.
//  ЭтоСторно				- Булево.
// 
Процедура СформироватьЗаписи(ПостфиксРесурсов, СтрокаТаблицы, Содержание, СтруктураШапкиДокумента, СтруктураКурсыВалют, ЭтоСторно = Ложь)
	
	// Изменение кода. Начало. 11.02.2016{{
	Если ЭтоСторно И НЕ ЗначениеЗаполнено(ДатаСторно) Тогда
		// Не делаем проводку на дату сторно, если ДатаСторно не заполнена.
		Возврат;
	КонецЕсли;
	// Изменение кода. Конец. 11.02.2016}}
		
	Запись = Движения.бит_Дополнительный_2.Добавить();
	
	Запись.Активность  = Истина;
	Запись.Организация = СтруктураШапкиДокумента.Организация;
	Запись.Период      = ?(ЭтоСторно, ДатаСторно, Дата);
	Запись.Содержание  = Содержание;
			
	Если ПостфиксРесурсов = "Дт" Тогда
		
		Запись_СчетДт = СтрокаТаблицы.СчетА;
		Запись_СчетКт = СтрокаТаблицы.СчетАП;
		
		ИмяСубконтоДт = "СубконтоА_";
		ИмяСубконтоКт = "Субконто_";
		
		Запись_Валюта        = СтрокаТаблицы.ВалютаДт;
		Запись_ВалютнаяСумма = СтрокаТаблицы.ВалютнаяСуммаДт;
				
		Запись_Количество    = СтрокаТаблицы.КоличествоДт;
		
		Запись_СуммаМУ   = СтрокаТаблицы.СальдоДт;
		Запись_СуммаРегл = СтрокаТаблицы.СуммаРеглДт;
		Запись_СуммаУпр  = СтрокаТаблицы.СуммаУпрДт;
					
	Иначе	
		
		Запись_СчетДт 		 = СтрокаТаблицы.СчетАП;
		Запись_СчетКт 		 = СтрокаТаблицы.СчетП;
		
		ИмяСубконтоДт = "Субконто_";
		ИмяСубконтоКт = "СубконтоП_";
		
		Запись_Валюта        = СтрокаТаблицы.ВалютаКт;
		Запись_ВалютнаяСумма = СтрокаТаблицы.ВалютнаяСуммаКт;
				
		Запись_Количество    = СтрокаТаблицы.КоличествоКт;
		
		Запись_СуммаМУ   = СтрокаТаблицы.СальдоКт;
		Запись_СуммаРегл = СтрокаТаблицы.СуммаРеглКт;
		Запись_СуммаУпр  = СтрокаТаблицы.СуммаУпрКт;
		
	КонецЕсли;
	
	// Счета.
	Запись.СчетДт = Запись_СчетДт;
	Запись.СчетКт = Запись_СчетКт;
    СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Запись.СчетДт);
    СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Запись.СчетКт);
	
	// Если это сторно - то суммы должны быть противоположными.
	Если ЭтоСторно Тогда 	
		Запись_ВалютнаяСумма = - Запись_ВалютнаяСумма;
		Запись_Количество    = - Запись_Количество;
		Запись_СуммаМУ   	 = - Запись_СуммаМУ;
		Запись_СуммаРегл 	 = - Запись_СуммаРегл;
		Запись_СуммаУпр  	 = - Запись_СуммаУпр;
	КонецЕсли;
	
	// Основные ресурсы
	Запись.СуммаМУ   	 = Запись_СуммаМУ;
	Запись.СуммаРегл 	 = Запись_СуммаРегл;
	Запись.СуммаУпр  	 = Запись_СуммаУпр;
	
	// Валюта и валютная сумма.
	Если СвСчДт.Валютный Тогда
		Запись.ВалютаДт        = Запись_Валюта;
		Запись.ВалютнаяСуммаДт = Запись_ВалютнаяСумма;
	КонецЕсли;   
	Если СвСчКт.Валютный Тогда
		Запись.ВалютаКт        = Запись_Валюта;
		Запись.ВалютнаяСуммаКт = Запись_ВалютнаяСумма;
	КонецЕсли;

	// Количесвто.
	Если СвСчДт.Количественный Тогда   		
		Запись.КоличествоДт = Запись_Количество;      		
	КонецЕсли; 
	Если СвСчКт.Количественный Тогда   		
		Запись.КоличествоКт = Запись_Количество;         		
	КонецЕсли;
	
	// Заполнение аналитик.
	бит_му_ОбщегоНазначения.ЗаполнитьАналитикуДт_Кт(Запись, СтрокаТаблицы, ИмяСубконтоДт, ИмяСубконтоКт, мКоличествоСубконтоМУ);
		
КонецПроцедуры // СформироватьЗаписи()

#КонецОбласти

#КонецОбласти

#Область Инициализация

мКоличествоСубконтоМУ = 4;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
